Repository: alt-gnome/apa
Catalog: po/*.po
Languages: ru

source: Invalid key-value pair, need key and value
ru: Неверная пара ключ-значение, необходимым ключ и значение

source: Invalid value, value cannot be empty
ru: Неверное значение, значение не может быть пустым

source: Unknown key, run `apa config list' to list all possible keys
ru: Неизвестный ключ, выполните `apa config list' для вывода всех доступных ключей

source: Invalid value. Try `apa config list' to see possible values
ru: Неверное значение. Попробуйте `apa config list' для вывода всех доступных значений

source: Unknown operation `%c' in `%s'
ru: Неизвестная операция `%c' в `%s'

source: Don't known what to do with %s
ru: Неизвестно, что делать с %s

source: Package `%s' not found, but packages with a similar name were found
ru: Пакет `%s' не найден, но были найдены пакеты с похожим названием

source: to remove
ru: для удаления

source: There are no packages left to do
ru: Не осталось пакетов для оперирование

source: to install
ru: для установки

source: APT is currently busy
ru: APT в данный момент занят

source: Unable to fetch some archives. Check your connection to repository. Run `apa update' or try use `--fix-missing' option
ru: Не удалось получить некоторые архивы. Проверьте подключение к репозиторию. Запустите `apa update' или попробуйте использовать опцию `--fix-missing'.

source: Option `-o/--option' value is incorrect. It should look like `OptionName=val'
ru: Значение опция `-o/--option' некорректно. Оно должно выглядеть как `OptionName=val'

source: Option `-c/--config' value is incorrect
ru: Значение опции `-c/--config' некорректно

source: Broken packages. Running `apa update' can help you
ru: Пакеты повреждены. Запуск `apa update' может помочь вам

source: For operation like `<package>+/-' use `do' command instead
ru: Для такой операции, как '<пакет>+/-', используйте команду `do'

source: Found task `%s' in packages. Skipping other
ru: Найдено задание `%s' в пакетах. Пропуск других

source: Package `%s' not found
ru: Пакет `%s' не найден

source: There are no packages left to install
ru: Не осталось пакетов для установки

source: There are no packages left to remove
ru: Не осталось пакетов для удаления

source: Unknown source
ru: Неизвестный источник

source: The query must be at least %s symbols
ru: Запрос должен содержать не меньше %s символов

source: The query cannot contain a `%s'
ru: Запрос не может содержать `%s'

source: The `%s' query is not suitable. The search query must be more than two characters long
ru: Запрос `%s' не подходит. Длина поискового запроса должна превышать два символа

source: Too many tasks, showing only the first 10
ru: Слишком много задач, отображаются только первые 10

source: Task %s:
ru: Задание %s:

source: Repo: %s
ru: Репозиторий: %s

source: Owner: %s
ru: Владелец: %s

source: State: %s
ru: Состояние: %s

source: Has %d subtasks
ru: Имеет %d подзаданий

source: Subtasks:
ru: Подзадания:

source: Subtask: %s
ru: Подзадание: %s

source: Package name: %s
ru: Имя пакета: %s

source: Invalid task id `%s'
ru: Неверный идентификатор задания `%s'

source: Unknown command `%s'
ru: Неизвестная команда `%s'

source: Unknown subcommand `%s' of `%s' command
ru: Неизвестная подкоманда `%s' команды `%s'

source: No subcommand. Try `apa %s --help'
ru: Нет подкоманды. Попробуйте `apa %s --help`

source: Unknown error message: `%s'
ru: Сообщение о неизвестной ошибке: `%s'

source: Unknown subcommand `%s'
ru: Неизвестная подкоманда `%s'

source: There are too many arguments
ru: Слишком много аргументов

source: There are too few arguments
ru: Слишком мало аргументов

source: Task `%s' is unknown or still building
ru: Задание `%s' неизвестно или ещё находится в сборке

source: Nothing found
ru: Ничего не найдено

source: Bad status code: `%d: %s'
ru: Плохой код статуса: `%d: %s'

source: Option `%s' need value
ru: Опция `%s' требует значения

source: Unknown option: `%s'
ru: Неизвестная опция `%s'

source: Unknown option with value: `%s'
ru: Неизвестная опция со значением: `%s'

source: Need root previlegies for `%s' command
ru: Нужны привелегии суперпользователя для команды `%s'

source: PackageKit is running
ru: Запущен PackageKit

source: Couldn't open configuration file.
ru: Не удалось открыть конфигурационный файл

source: Error in config. Recreating…
ru: Ошибка в конфигурации. Пересоздание…

source: Key `%s' doesn't exists
ru: Ключа `%s' не существует

source: Wrong type.
ru: Неверный тип

source: APA — ALT Packages Assistant. Your best friend in this cruel world of many package tools.
ru: APA — ALT Packages Assistant. Ваш лучший друг в этом жестоком мире множества инструментов для упаковки.

source: Command to install packages. The following arguments can be passed: a regex pattern of the package name; a file belonging to the package; a task number. Attention: only one task number can be passed, and when it is detected, all other arguments will be ignored. The `apa task' command is recommended for working with tasks.
ru: Команда для установки пакетов. Могут быть приняты следующие аргументы: шаблон регулярного выражения для имени пакета; файл, поставляемый с пакетом; номер задания. Внимание: может быть принят только один номер задания, и если он найдет, другие аргументы будут проигнорированы. Для работы с заданиями рекомендуется команда `apa task'.

source: Command to reinstall packages. Same as `apa install --reinstall <..>'.
ru: Команда для переустановки пакетов. То же, что и `apa install --reinstall <..>'.

source: Command to remove packages using a regex.
ru: Команда для удаления пакетов с использованием регулярных выражений.

source: Command that combines the installation and removal of packages. The postfix `+' is used for installation, and for deletion `-'.
ru: Команда, совмещающая установку и удаление пакетов. Постфикс `+' используется для установки, `-' — для удаления

source: Need for resynchronize the package index files from their sources. The indexes of available packages are fetched from the location(s) specified in `/etc/apt/sources.list'.
ru: Необходимо для повторной синхронизации индексных файлов пакетов из их источниковв. Индексы доступных пакетов собираются из источника(ов), занесённых в `/etc/apt/sources.list'.

source: The `upgrade' command is used to install the newest versions of all packages currently installed on the system from the sources enumerated in `/etc/apt/sources.list'. Packages currently installed with new versions available are retrieved and upgraded; under no circumstances are currently installed packages removed, or packages not already installed retrieved and installed. New versions of currently installed packages that cannot be upgraded without changing the install status of another package will be left at their current version. An update must be performed first so that apa knows that new versions of packages are available. Performs automatic updates based on `auto-update' of the APA config.
ru: Команда `upgrade' используется для установки новейших версий всех пакетов, установленных в данный момент в системе, из источников, перечисленных в `/etc/apt/sources.list". Извлекаются и обновляются установленные в данный момент пакеты с доступными новыми версиями; ни при каких обстоятельствах установленные в данный момент пакеты не удаляются и не извлекаются и не устанавливаются еще не установленные пакеты. Новые версии установленных в данный момент пакетов, которые невозможно обновить без изменения статуса установки другого пакета, будут сохранены в их текущей версии. Сначала необходимо выполнить обновление, чтобы apa знал, что доступны новые версии пакетов. Выполняет автоматические обновления на основе `auto-update' конфигурации APA.

source: A subcommand for working with the kernel.
ru: Подкоманда для работы с ядром.

source: Upgrade kernel.
ru: Обновление ядра.

source: Print list of available kernels.
ru: Показать список доступных ядер.

source: A subcommand for working with the APA config.
ru: Подкоманда для работы с конфигурацией APA.

source: Reset config value by it key. You can reset entire config with `--all' option.
ru: Сбросить значение конфигурации по ключу. Для полного сброса конфигурации используйте опцию `--all'.

source: List all possible keys values.
ru: Список доступных ключей.

source: Get config value by it key.
ru: Получить конфигурационное значение по ключу.

source: Set config value by pairs ob `key=value'.
ru: Установить конфигурационное значение из пар `ключ=значение'.

source: A subcommand for working with tasks.
ru: Подкоманда для работы с заданиями.

source: Add task as repository.
ru: Добавить задание как репозиторий.

source: Search task by owner, branch, package name, etc.
ru: Поиск задания по владельцу, ветке, имени пакета и другому.

source: Show task information with state and all subtasks.
ru: Показать информацию о заданию с состоянием всех подзаданий.

source: Install task by task number. You can pass tasks packages names next to task number.
ru: Устанавливайте задания по номеру. Вы можете указать названия пакетов вместе с номером.

source: List task packages.
ru: Список пакетов в задании

source: A subcommand for working with repositories.
ru: Подкоманда для работы с репозиториями

source: Show enabled sources in system.
ru: Показать включённые в системе источники.

source: Add source to sources list. Sources format described at apt-repo(8).
ru: Добавить источник в список источников. Формат источников описан в apt-repo(8).

source: Add Aides Repo to sources list.
ru: Добавить репозиторий Аид в список источников

source: Remove Aides Repo from sources list.
ru: Удалить репозиторий Аид из списка источников

source: Remove source from sources list.
ru: Удалить источник из списка источников

source: Remove packages that were automatically installed to satisfy dependencies for other packages and are now no longer needed. Warning: Use this command carefully.
ru: Удалите пакеты, которые были автоматически установлены для удовлетворения зависимостей других пакетов и которые теперь больше не нужны. Внимание: используйте эту команду осторожно.

source: Display a list of installed packages. You can pass arguments to search through the list.
ru: Показать список установленных пакетов. Вы можете передать аргументы для поиска по списку.

source: Show information about package.
ru: Показать информацию о пакете

source: Perform a file search among the packages in the repository. It supports searching among installed packages using the `--installed' option.
ru: Выполняет поиск файлов среди пакетов в репозитории. Поддерживается поиск среди установленных пакетов с использованием параметра `--installed'.

source: Show this help text. Same as `apa --help'.
ru: Отобразить текст данной справки. То же, что и `apa --help'.

source: Print APA version. Same as `apa --version'.
ru: Отобразить версию APA. То же, что и `apa --version'.

source: The file to store the package cache. The package cache is the primary cache used by all operations.
ru: Файл для хранения кэша пакетов. Кэш пакетов является основным кэшем, используемым во всех операциях.

source: The file to store the source cache. The source is used only by gencaches and it stores a parsed version of the package information from remote sources. When building the package cache the source cache is used to avoid reparsing all of the package files.
ru: Файл для хранения исходного кэша. Исходный код используется только gencaches и хранит обработанную версию информации о пакете из удалённых источников. При создании кэша пакетов используется исходный кэш, чтобы избежать повторной обработки всех файлов пакета.

source: Do not show the progress bar. Suitable for logs.
ru: Не отображать индикатор выполнения. Подходит для журналов.

source: Print only important dependencies; for use with unmet. Causes only Depends and Pre-Depends relations to be printed.
ru: Показать только важные зависимости; для использования с unmet. Выводит только зависимые и предзависимые отношения.

source: Print full package records when searching.
ru: Показать полные записи о пакетах при поиске.

source: Make dependencies recursive so that all packages mentioned are printed once.
ru: Сделать зависимости рекурсивными, чтобы все упомянутые пакеты печатались один раз.

source: Only search on the package names, not the long descriptions.
ru: Поиск только по названиям пакетов, а не по длинным описаниям.

source: Search among installed packages. Works well with `--names-only' option
ru: Выполняет поиск среди установленных пакетов. Хорошо работает с параметром `--names-only'.

source: Set a APT Configuration Option; This will set an arbitrary configuration option. The syntax is `-o Foo::Bar=bar' or `--option=Foo::Bar=bar'.
ru: Установка параметра конфигурации APT; это позволит задать произвольный параметр конфигурации. Синтаксис: `-o Foo::Bar=bar' или `--option=Foo::Bar=bar'.

source: Path to APT Configuration File; Specify a configuration file to use. The program will read the default configuration file and then this configuration file. If configuration settings need to be set before the default configuration files are parsed specify a file with the APT_CONFIG environment variable. See apt.conf(5) for syntax information.
ru: Путь к файлу конфигурации APT; Укажите используемый файл конфигурации. Программа сначала прочитает файл конфигурации по умолчанию, а затем этот файл конфигурации. Если перед анализом файлов конфигурации по умолчанию необходимо задать параметры конфигурации, укажите файл с переменной среды APT_CONFIG. Смотрите apt.conf(5) для получения информации о синтаксисе.

source: Reset entire config to defaults values.
ru: Сбросить всю конфигурацию до значений по умолчанию.

source: Run `apa update' automatically before some commands.
ru: Запуск `apa update' автоматически перед некоторыми командами.

source: Use fuzzy search in case of unsuccessful install via `apa install'.
ru: Использовать нечёткий поиск в случае неудачной установки через `apa install'.

source: Automatically upgrade the kernel when executing an `apa upgrade'.
ru: Автоматически обновлять ядро, когда запускается `apa upgrade'.

source: Don't print any to stdout.
ru: Ничего не выводить в стандартный вывод.

source: No-act. Perform ordering simulation.
ru: Ничего не делать. Сымитировать действия.

source: Assume `Yes' to all queries and do not prompt.
ru: Ответить `Да' на все запросы и не спрашивать.

source: Attempt to continue if the integrity check fails.
ru: Попытаться продолжить, если проверка целостности завершится неудачей.

source: Show verbose version numbers.
ru: Показывать подробные номера версий.

source: Disables downloading of packages. This is best used with `--ignore-missing' to force APT to use only the `.rpm' it has already downloaded.
ru: Отключает загрузку пакетов. Это лучше всего использовать с параметром `--ignore-missing', чтобы заставить APT использовать только те файлы `.rpm', которые он уже загрузил.

source: Ignore missing packages; If packages cannot be retrieved or fail the integrity check after retrieval (corrupted package files), hold back those packages and handle the result.
ru: Игнорируйте отсутствующие пакеты; Если пакеты не могут быть извлечены или не прошли проверку целостности после извлечения (повреждённые файлы пакетов), эти пакеты будут отложены и будет обработан результат.

source: Download only - do NOT install or unpack archives.
ru: Только для скачивания — НЕ устанавливать или распаковывать архивы.

source: Show a list of upgraded packages as well.
ru: Также отобразить список обновлённых пакетов.

source: Also upgrade kernel.
ru: Также обновить ядро.

source: When removing packages, remove dependencies as possible.
ru: При удалении пакетов, по возможности удалить зависимости

source: Reinstall packages.
ru: Переустановить пакеты.

source: Build the source package after fetching it.
ru: Построить исходный пакет после его извлечения.

source: No-act. Changes only shown, is not performed.
ru: Ничего не делать. Изменения только отображаются, не приминяются.

source: Need for the special case when you want to use hasher(7) together with a local APT configuration.
ru: Необходимо для особых случаев, когда вы хотите использовать hasher(7) вместе с локальной конфигурацией APT.

source: List all repositories.
ru: Список всех репозиториев.

source: RPM information output format.
ru: Формат вывода информации RPM.

source: Sort the output in alphabetical order.
ru: Отсортируйте выходные данные в алфавитном порядке.

source: Sorts in the opposite direction of the `--sort' option.
ru: Сортировка выполняется в направлении, параметру `--sort'.

source: Show packages sorted by installation date.
ru: Показать пакеты, отсортированные по дате установки.

source: Show package names. Equal to `rpm -qa'
ru: Показывать имена пакетов. То же, что и `rpm -qa'

source: Print package files.
ru: Показать файлы пакета.

source: Search among the installed packages.
ru: Искать среди установленных пакетов.

source: To make the print more classic. Also removes the color selection.
ru: Чтобы сделать вывод более классическим. Также убирается выбор цвета.

source: Which branch of the repository to use for the search. It is ignored if the `--installed' option is set. By default: `sisyphus'.
ru: Какую ветку репозитория использовать для поиска. Если задан параметр `--installed', он игнорируется. По умолчанию: `sisyphus'.

source: In packages for which architecture to look for. It is ignored if the `--installed' option is set. Used current arch by default.
ru: В пакетах, для которых требуется указать архитектуру. Если установлен параметр `--installed', он игнорируется. По умолчанию используется текущая архитектура.

source: Find tasks by source package name.
ru: Найти задания по названию исходного пакета.

source: Task owner.
ru: Владелец задания.

source: Branch name.
ru: Имя ветки.

source: Task state.
ru: Состояние задания.

source: Add kernel headers to install.
ru: Добавить заголовки ядра при установке.

source: Select all available kernel modules to install.
ru: Выбрать все доступные модули ядра при установке.

source: Interactive modules selection.
ru: Интерактивный выбор модулей.

source: Add `-debuginfo' package to install.
ru: Добавить `-debuginfo' пакет при установке.

source: Include (add) external module (by a short name).
ru: Включить (добавить) внешний модуль (с кратким названием).

source: Exclude (del) external module from install.
ru: Исключить (удалить) внешний модуль из установки.

source: Select desired kernel flavour (def, rt, etc) by default it's the same as the booted kernel, special name `latest' selects the newest flavour.
ru: Выберите желаемый вариант ядра (def, rt и т.д.). По умолчанию он совпадает с загруженным ядром, специальное название `latest' выбирает самый новый вариант.

source: Desired kernel release for the current or specified flavour (allowed formats by example: old format: alt1, 5.7.19-alt1; classic kernel release: 5.7.19-std-def-alt1; package name: [kernel-image-]std-def-5.7.19-alt1).
ru: Желаемый выпуск ядра для текущего или указанного варианта (допустимые форматы, например: старый формат: alt1, 5.7.19-alt1; классический выпуск ядра: 5.7.19-std-def-alt1; имя пакета: [kernel-image-]std-def-5.7.19-alt1).

source: No help for `%s'
ru: Нет справки для `%s'

source: No help for `%s %s'
ru: Нет справки для `%s %s'

source: Available commands:
ru: Доступные команды:

source: Error:
ru: Ошибка:

source: Choose package %s:
ru: Выберите пакет %s:

source: [0 - exit; -1 - skip]
ru: [0 - выход; -1 - пропустить]

source: You should %s
ru: Вы должны %s

source: create issue↗️
ru: создать задачу↗️
